<a href="https://colab.research.google.com/github/mariananlemos/Limpeza_Dados/blob/main/SumarizandoDados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
datas = pd.date_range('20200101', periods=6)

df = pd.DataFrame(np.random.randn(6, 4), index=datas, columns=['Var_A', 'Var_B', 'Var_C', 'Var_D'])

In [ ]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'Python'})

In [ ]:
df

               Var_A     Var_B     Var_C     Var_D
2020-01-01  0.108054  0.451149 -0.476590  1.646939
2020-01-02  2.033522  1.130295  0.393841 -0.872713
2020-01-03 -1.021104  0.221334  1.535066 -0.902563
2020-01-04  0.927034 -0.568369  0.247304  0.709899
2020-01-05 -1.868256  1.482526 -0.515925 -1.156223
2020-01-06 -0.241638 -1.681972 -0.133969  1.122180

In [ ]:
df.shape

(6, 4)

In [ ]:
df.dtypes

Var_A    float64
Var_B    float64
Var_C    float64
Var_D    float64
dtype: object

In [ ]:
df2

     A          B    C  D      E       F
0  1.0 2013-01-02  1.0  3   test  Python
1  1.0 2013-01-02  1.0  3  train  Python
2  1.0 2013-01-02  1.0  3   test  Python
3  1.0 2013-01-02  1.0  3  train  Python

In [ ]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [ ]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [ ]:
df

               Var_A     Var_B     Var_C     Var_D
2020-01-01  0.108054  0.451149 -0.476590  1.646939
2020-01-02  2.033522  1.130295  0.393841 -0.872713
2020-01-03 -1.021104  0.221334  1.535066 -0.902563
2020-01-04  0.927034 -0.568369  0.247304  0.709899
2020-01-05 -1.868256  1.482526 -0.515925 -1.156223
2020-01-06 -0.241638 -1.681972 -0.133969  1.122180

In [ ]:
df1 = df.reindex(index=datas[0:4], columns=list(df.columns) + ['Var_E'])

In [ ]:
df1

               Var_A     Var_B     Var_C     Var_D  Var_E
2020-01-01  0.108054  0.451149 -0.476590  1.646939    NaN
2020-01-02  2.033522  1.130295  0.393841 -0.872713    NaN
2020-01-03 -1.021104  0.221334  1.535066 -0.902563    NaN
2020-01-04  0.927034 -0.568369  0.247304  0.709899    NaN

In [ ]:
df1.loc[datas[0]:datas[1], 'Var_E'] = 77

In [ ]:
df1

               Var_A     Var_B     Var_C     Var_D  Var_E
2020-01-01  0.108054  0.451149 -0.476590  1.646939   77.0
2020-01-02  2.033522  1.130295  0.393841 -0.872713   77.0
2020-01-03 -1.021104  0.221334  1.535066 -0.902563    NaN
2020-01-04  0.927034 -0.568369  0.247304  0.709899    NaN

In [ ]:
df1.dtypes

Var_A    float64
Var_B    float64
Var_C    float64
Var_D    float64
Var_E    float64
dtype: object

In [ ]:
df1.describe()

In [ ]:
# dados missing

In [ ]:
df1.isna().sum()

Var_A    0
Var_B    0
Var_C    0
Var_D    0
Var_E    2
dtype: int64

In [ ]:
df1

               Var_A     Var_B     Var_C     Var_D  Var_E
2020-01-01  0.108054  0.451149 -0.476590  1.646939   77.0
2020-01-02  2.033522  1.130295  0.393841 -0.872713   77.0
2020-01-03 -1.021104  0.221334  1.535066 -0.902563    NaN
2020-01-04  0.927034 -0.568369  0.247304  0.709899    NaN

In [ ]:
df1.dropna(axis=0, how='any')

               Var_A     Var_B     Var_C     Var_D  Var_E
2020-01-01  0.108054  0.451149 -0.476590  1.646939   77.0
2020-01-02  2.033522  1.130295  0.393841 -0.872713   77.0

In [ ]:
df1.dropna(axis=1, how='any')

               Var_A     Var_B     Var_C     Var_D
2020-01-01  0.108054  0.451149 -0.476590  1.646939
2020-01-02  2.033522  1.130295  0.393841 -0.872713
2020-01-03 -1.021104  0.221334  1.535066 -0.902563
2020-01-04  0.927034 -0.568369  0.247304  0.709899

In [ ]:
import pandas as pd
import numpy as np

datas = pd.date_range('20190101', periods = 60, freq="D")

df = pd.DataFrame(np.random.randn(60,5), index = datas, columns = list("ABCDE")) 

df.head(3)

df['F'] = df.A[ df.A > 0 ]

df.head(3)

df.shape

df2 = df.copy()

df2.dropna().shape

df3.fillna(np.mean(df3.A))

df4 = df.copy()

df4.fillna(value = 77777)

In [ ]:
import pandas as pd
import numpy as np

df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'Python',
   ...:                     'G': [2,2,4,4],
   ...:                     'H': [np.nan,2,4,np.nan]  })

df2.nunique(axis=1, dropna=True)

df2.drop_duplicates(subset='G', keep=False)

df2.sort_values()

In [ ]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'Col1':['A','A','B', np.nan, 'D','C'], 'Col2':[2,1,9,8,7,4], 'Col3':[0,1,9,4,2,3]})

In [ ]:
df.sort_values(by=['Col3'], ascending=False)

In [ ]:
def inserir_linha(idx, df, df_inserir):
    dfA = df.iloc[:idx, ]
    dfB = df.iloc[idx:, ]

    df = dfA.append(df_inserir).append(dfB).reset_index(drop = True)

    return df

In [ ]:
di = pd.DataFrame(data=[['A',99,6]], columns=list(df.columns))

In [ ]:
dii = pd.DataFrame(data=[['A',99,6]])

In [ ]:
inserir_linha(1,df,di)

In [ ]:
list(df.columns)